{
  "dom": {
    "Legitimate": [
      "Our dynamic feels stronger when our roles are clearly defined.",
      "Titles, rituals, or symbols (like honorifics or collars) reinforce my authority.",
      "I use structure—rules, protocols, or check-ins—to sustain the dynamic.",
      "Clear agreements about my authority make the dynamic stable.",
      "I enjoy rituals that express or reaffirm my authority."
    ],
    "Reward": [
      "I use praise, affection, or pleasure to reinforce good behavior.",
      "I grant privileges—attention, permission, or release—as recognition.",
      "Positive reinforcement works better than punishment in our dynamic.",
      "I take satisfaction in creating moments of joy or pride for my partner.",
      "Rewarding effort deepens connection and trust between us."
    ],
    "Coercive": [
      "I use punishment or correction when boundaries are broken.",
      "Withholding pleasure or attention is one way I guide behavior.",
      "Discipline or consequences help maintain our dynamic’s structure.",
      "I aim to make correction feel fair and caring, not cruel.",
      "My authority feels stronger when consequences are consistent."
    ],
    "Referent": [
      "My authority comes primarily from emotional connection and trust.",
      "I invest in closeness before I claim control.",
      "I want my partner to obey because they want to, not because they have to.",
      "Our bond makes structure and power exchange feel natural.",
      "Maintaining trust matters more to me than enforcing obedience."
    ],
    "Expert": [
      "My confidence comes from skill—rope, impact, hypnosis, or other practices.",
      "I keep learning techniques and theory to improve my dominance.",
      "I feel most powerful when I demonstrate competence through action.",
      "I earn authority through skill, not just by taking a title.",
      "My partner’s trust grows when they see my focus on safety and mastery."
    ],
    "Informational": [
      "I explain the reasons or intentions behind what I do when it feels right.",
      "I use words, tone, and framing to shape the emotional flow of a scene.",
      "I help my partner understand the “why” behind actions or rules.",
      "Talking together after scenes helps strengthen trust and understanding.",
      "Sharing my thoughts and reasoning makes my authority feel clearer and more grounded."
    ]
  },
  "sub": {
    "Legitimate": [
      "Our dynamic feels stronger when our roles are clearly defined.",
      "Titles, rituals, or symbols (like collars or honorifics) help me stay in the right mindset.",
      "I feel safer when my Dominant sets clear rules or protocols.",
      "I feel uneasy when the rules or expectations of our dynamic aren’t clear.",
      "I enjoy rituals that remind me of the power difference between us."
    ],
    "Reward": [
      "Praise or affection from my Dominant motivates me more than punishment.",
      "I look forward to rewards—attention, touch, or permission—as signs of approval.",
      "I feel proud when my Dominant recognizes my effort or obedience.",
      "I know I’ve done well when I’m given praise, pleasure, or privileges.",
      "Rewards help me understand how to please my Dominant."
    ],
    "Coercive": [
      "I accept punishment or correction as part of my submission.",
      "Denial or discipline feels meaningful when it’s done with care.",
      "Consequences remind me of the structure and seriousness of our dynamic.",
      "I respect my Dominant more when consequences are consistent and fair.",
      "I feel grounded when my Dominant enforces boundaries instead of ignoring them."
    ],
    "Referent": [
      "My willingness to obey comes mostly from trust and affection.",
      "I follow more easily when I feel emotionally connected to my Dominant.",
      "I care deeply about my Dominant’s opinion of me.",
      "When our emotional bond is strong, control and structure feel natural.",
      "I submit because I want to, not because I have to."
    ],
    "Expert": [
      "I feel safer when my Dominant shows skill and knowledge in what they do.",
      "Their competence helps me relax and surrender more deeply.",
      "I trust my Dominant’s guidance because they take learning and safety seriously.",
      "I follow instructions more easily when they clearly know their craft.",
      "Their expertise turns obedience into trust, not obligation."
    ],
    "Informational": [
      "I appreciate when my Dominant explains what’s happening or why it matters.",
      "Understanding the reasons behind things helps me stay calm and present.",
      "My Dominant’s words and tone shape how I experience the scene.",
      "Talking together after play helps me feel valued and understood.",
      "I trust more deeply when my Dominant shares their thoughts and intentions openly."
    ]
  }
}

